* but heartbeat issue, TLS heartbeat extension

- 하트블리드
- heartbleed bug
- openssl 1.0.1 through 1.0.1f


- improper input validation
- rfc6520
- CVE-2014-0160
- compile with option -DOPENSSL_NO_HEARTBEATS

* problem

- steal secret key > new key

#+BEGIN_SRC emacs-lisp

(if 'bird 'bird)
(if 'bird (cons 'bird '496c))

#+END_SRC

#+RESULTS:
: (bird . 496c)
